## Exercise:

Write a pandas code to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

The query result format is in the following example.

In [7]:
import pandas as pd
# Create the Person and Address tables as dataframes
person_df = pd.DataFrame({
    'personId': [1, 2],
    'lastName': ['Wang', 'Alice'],
    'firstName': ['Allen', 'Bob']
})

address_df = pd.DataFrame({
    'addressId': [1, 2],
    'personId': [2, 3],
    'city': ['New York City', 'Leetcode'],
    'state': ['New York', 'California']
})

In [8]:
person_df.describe()

       personId
count  2.000000
mean   1.500000
std    0.707107
min    1.000000
25%    1.250000
50%    1.500000
75%    1.750000
max    2.000000

In [9]:
person_df.dtypes

personId      int64
lastName     object
firstName    object
dtype: object

In [10]:
person_df.columns

Index(['personId', 'lastName', 'firstName'], dtype='object')

In [11]:
person_df

   personId lastName firstName
0         1     Wang     Allen
1         2    Alice       Bob

In [12]:
address_df

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [17]:
output_columns = ['firstName', 'lastName', 'city', 'state']
person_df.merge(address_df, on="personId", how="left")[output_columns]

  firstName lastName           city     state
0     Allen     Wang            NaN       NaN
1       Bob    Alice  New York City  New York